In [7]:
import pandas as pd
import numpy as np

In [8]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

In [9]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [10]:
t = pd.Series([1, 3, 5, np.nan, 6, 8], index = ['a', 'b', 'c', 'd', 'e', 'f'])

In [11]:
t

a    1.0
b    3.0
c    5.0
d    NaN
e    6.0
f    8.0
dtype: float64

![title](class1.png)

In [16]:
all_of_us = pd.Series(['Abreu','Chang','De Sanctis','Höhne','Munne','Pardo','Foradada','Basbug','Guerguy','Akesson','Petit','Taskin','Ferri','Rocher'], 
                      index = ['Alberto','Chao-Ting','Emanuele','Fabia','Ingrid','Javier','Josep','Kerim','Laurent','Lucas','Miquel','Onur','Pau','Salva'])

In [17]:
all_of_us

Alberto           Abreu
Chao-Ting         Chang
Emanuele     De Sanctis
Fabia             Höhne
Ingrid            Munne
Javier            Pardo
Josep          Foradada
Kerim            Basbug
Laurent         Guerguy
Lucas           Akesson
Miquel            Petit
Onur             Taskin
Pau               Ferri
Salva            Rocher
dtype: object

QUESTION: If wou were on a database, what would you use as index?

In [18]:
ironhackers = {'Alberto':'Abreu','Chao-Ting':'Chang','Emanuele ':'De Sanctis','Fabia':'Höhne','Ingrid':'Munne','Javier':'     Pardo','Josep':'Foradada','Kerim':'Basbug','Laurent':'Guerguy','Lucas':'Akesson','Miquel':'Petit','Onur':'Taskin','Pau':'Ferri','Salva':'Rocher'}

In [19]:
ironhackers

{'Alberto': 'Abreu',
 'Chao-Ting': 'Chang',
 'Emanuele ': 'De Sanctis',
 'Fabia': 'Höhne',
 'Ingrid': 'Munne',
 'Javier': '     Pardo',
 'Josep': 'Foradada',
 'Kerim': 'Basbug',
 'Laurent': 'Guerguy',
 'Lucas': 'Akesson',
 'Miquel': 'Petit',
 'Onur': 'Taskin',
 'Pau': 'Ferri',
 'Salva': 'Rocher'}

Similar to dictionaries right? But we can do a lot of more things with them. What if we want to add a column? Then you need something like a table, there comes the dataframes!

![title](classroom.png)

In [20]:
pd.DataFrame(all_of_us)

                    0
Alberto         Abreu
Chao-Ting       Chang
Emanuele   De Sanctis
Fabia           Höhne
Ingrid          Munne
Javier          Pardo
Josep        Foradada
Kerim          Basbug
Laurent       Guerguy
Lucas         Akesson
Miquel          Petit
Onur           Taskin
Pau             Ferri
Salva          Rocher

Let's improve a little bit this df. First, the index

In [21]:
pd.DataFrame(all_of_us)

                    0
Alberto         Abreu
Chao-Ting       Chang
Emanuele   De Sanctis
Fabia           Höhne
Ingrid          Munne
Javier          Pardo
Josep        Foradada
Kerim          Basbug
Laurent       Guerguy
Lucas         Akesson
Miquel          Petit
Onur           Taskin
Pau             Ferri
Salva          Rocher

In [24]:
last_names = pd.Series(['Abreu','Chang','De Sanctis','Höhne','Munne','Pardo','Foradada','Basbug','Guerguy','Akesson','Petit','Taskin','Ferri','Rocher'])

In [25]:
names = pd.Series(['Alberto','Chao-Ting','Emanuele','Fabia','Ingrid','Javier','Josep','Kerim','Laurent','Lucas','Miquel','Onur','Pau','Salva'])

In [26]:
pd.DataFrame({'names': names, 'last_names': last_names})

        names  last_names
0     Alberto       Abreu
1   Chao-Ting       Chang
2    Emanuele  De Sanctis
3       Fabia       Höhne
4      Ingrid       Munne
5      Javier       Pardo
6       Josep    Foradada
7       Kerim      Basbug
8     Laurent     Guerguy
9       Lucas     Akesson
10     Miquel       Petit
11       Onur      Taskin
12        Pau       Ferri
13      Salva      Rocher

In [27]:
genders = pd.Series(['Man','Woman','Man','Woman','Woman','Man','Man','Man','Man','Man','Man','Man','Man','Man'])

In [28]:
pd.DataFrame({'names': names, 'last_names': last_names, 'gender': genders })

        names  last_names gender
0     Alberto       Abreu    Man
1   Chao-Ting       Chang  Woman
2    Emanuele  De Sanctis    Man
3       Fabia       Höhne  Woman
4      Ingrid       Munne  Woman
5      Javier       Pardo    Man
6       Josep    Foradada    Man
7       Kerim      Basbug    Man
8     Laurent     Guerguy    Man
9       Lucas     Akesson    Man
10     Miquel       Petit    Man
11       Onur      Taskin    Man
12        Pau       Ferri    Man
13      Salva      Rocher    Man

Dataframes are just about adding series and series and series, and we have all the functions related to data!

I want only the names. A dataframe is like a list of series, and we access the columns exactly the same.

In [29]:
data_bootcamp = pd.DataFrame({'names': names, 'last_names': last_names, 'gender': genders })

In [30]:
data_bootcamp['names']

0       Alberto
1     Chao-Ting
2      Emanuele
3         Fabia
4        Ingrid
5        Javier
6         Josep
7         Kerim
8       Laurent
9         Lucas
10       Miquel
11         Onur
12          Pau
13        Salva
Name: names, dtype: object

Here we have the series again, and all the info related. For the type:

In [31]:
data_bootcamp.dtypes

names         object
last_names    object
gender        object
dtype: object

In [32]:
competition = pd.Series([1,3,5,7,8,2,4,7,4,7,5,6,9,10,4,6])

In [33]:
data_bootcamp['competition'] = competition

In [34]:
data_bootcamp

        names  last_names gender  competition
0     Alberto       Abreu    Man            1
1   Chao-Ting       Chang  Woman            3
2    Emanuele  De Sanctis    Man            5
3       Fabia       Höhne  Woman            7
4      Ingrid       Munne  Woman            8
5      Javier       Pardo    Man            2
6       Josep    Foradada    Man            4
7       Kerim      Basbug    Man            7
8     Laurent     Guerguy    Man            4
9       Lucas     Akesson    Man            7
10     Miquel       Petit    Man            5
11       Onur      Taskin    Man            6
12        Pau       Ferri    Man            9
13      Salva      Rocher    Man           10

In [78]:
data_bootcamp.dtypes

names          object
last_names     object
coutries       object
competition     int64
dtype: object

In [35]:
data_bootcamp = data_bootcamp.astype({'competition': float})

In [36]:
data_bootcamp.competition

0      1.0
1      3.0
2      5.0
3      7.0
4      8.0
5      2.0
6      4.0
7      7.0
8      4.0
9      7.0
10     5.0
11     6.0
12     9.0
13    10.0
Name: competition, dtype: float64

You always need to check the type!

Now let's get some info from the dataframe:

In [37]:
data_bootcamp[['names', 'competition']]

        names  competition
0     Alberto          1.0
1   Chao-Ting          3.0
2    Emanuele          5.0
3       Fabia          7.0
4      Ingrid          8.0
5      Javier          2.0
6       Josep          4.0
7       Kerim          7.0
8     Laurent          4.0
9       Lucas          7.0
10     Miquel          5.0
11       Onur          6.0
12        Pau          9.0
13      Salva         10.0

In [38]:
classification = data_bootcamp[['names', 'competition']]

In [39]:
classification[classification['competition'] < 4]

       names  competition
0    Alberto          1.0
1  Chao-Ting          3.0
5     Javier          2.0

In [40]:
classification[(classification['competition'] < 4) & (classification['competition'] != 0)]

       names  competition
0    Alberto          1.0
1  Chao-Ting          3.0
5     Javier          2.0

In [41]:
winners = classification[(classification['competition'] < 4) & (classification['competition'] != 0)]
winners

       names  competition
0    Alberto          1.0
1  Chao-Ting          3.0
5     Javier          2.0

We could also sort the dataframe and the take only the first

In [42]:
classification.sort_values(by=['competition'])

        names  competition
0     Alberto          1.0
5      Javier          2.0
1   Chao-Ting          3.0
6       Josep          4.0
8     Laurent          4.0
2    Emanuele          5.0
10     Miquel          5.0
11       Onur          6.0
3       Fabia          7.0
7       Kerim          7.0
9       Lucas          7.0
4      Ingrid          8.0
12        Pau          9.0
13      Salva         10.0

If we want the other way? Go to the docs

In Pandas everything is about index, so if we want to take the 3 first, is like saying this is the new index we reset the index

In [43]:
classification.sort_values(by=['competition']).reset_index(drop = True)

        names  competition
0     Alberto          1.0
1      Javier          2.0
2   Chao-Ting          3.0
3       Josep          4.0
4     Laurent          4.0
5    Emanuele          5.0
6      Miquel          5.0
7        Onur          6.0
8       Fabia          7.0
9       Kerim          7.0
10      Lucas          7.0
11     Ingrid          8.0
12        Pau          9.0
13      Salva         10.0

In [44]:
classification.sort_values(by=['competition']).reset_index(drop = True).iloc[0:3]

       names  competition
0    Alberto          1.0
1     Javier          2.0
2  Chao-Ting          3.0

If we want to copy a table then:

In [45]:
win = winners.copy()

Some mathematical functions. We can do them to all the dataframe or to one series:

In [46]:
colnames = ['Column1','Column2','Column3','Column4','Column5']
random_numbers = pd.DataFrame(np.random.random((10,5)), columns=colnames)
random_numbers

    Column1   Column2   Column3   Column4   Column5
0  0.101027  0.913039  0.001680  0.841424  0.858563
1  0.121305  0.261014  0.164566  0.334710  0.341955
2  0.405326  0.276052  0.481629  0.551277  0.666748
3  0.541329  0.519690  0.166845  0.920853  0.938416
4  0.789075  0.447559  0.899484  0.478797  0.299540
5  0.283348  0.603427  0.096320  0.866529  0.879303
6  0.312087  0.195937  0.306533  0.138171  0.693187
7  0.470482  0.955006  0.475447  0.958271  0.922271
8  0.950964  0.557237  0.708510  0.917432  0.639748
9  0.185301  0.572348  0.871755  0.395762  0.704921

In [47]:
random_numbers.sum()

Column1    4.160243
Column2    5.301309
Column3    4.172769
Column4    6.403225
Column5    6.944652
dtype: float64

In [48]:
random_numbers.sum().sum()

26.982198448223365

In [49]:
random_numbers.sum(axis=0)

Column1    4.160243
Column2    5.301309
Column3    4.172769
Column4    6.403225
Column5    6.944652
dtype: float64

In [50]:
random_numbers.sum(axis=1)

0    2.715733
1    1.223550
2    2.381031
3    3.087133
4    2.914455
5    2.728927
6    1.645914
7    3.781477
8    3.773891
9    2.730086
dtype: float64

In [51]:
random_numbers.min(axis=0)

Column1    0.101027
Column2    0.195937
Column3    0.001680
Column4    0.138171
Column5    0.299540
dtype: float64

In [52]:
random_numbers.max(axis=0)

Column1    0.950964
Column2    0.955006
Column3    0.899484
Column4    0.958271
Column5    0.938416
dtype: float64

In [53]:
random_numbers.mean(axis=0)

Column1    0.416024
Column2    0.530131
Column3    0.417277
Column4    0.640323
Column5    0.694465
dtype: float64